; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=384, out_folder=./training, instance_id=88, seed=2112, goal_proportion=0.03

(define (problem blocksworld-88)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 - object)
 (:init 
    (arm-empty)
    (clear b346)
    (on b346 b144)
    (on b144 b162)
    (on b162 b195)
    (on b195 b166)
    (on b166 b237)
    (on-table b237)
    (clear b88)
    (on b88 b8)
    (on b8 b384)
    (on b384 b14)
    (on b14 b246)
    (on b246 b149)
    (on b149 b349)
    (on b349 b104)
    (on-table b104)
    (clear b241)
    (on b241 b380)
    (on-table b380)
    (clear b280)
    (on b280 b331)
    (on b331 b21)
    (on b21 b15)
    (on-table b15)
    (clear b204)
    (on b204 b64)
    (on b64 b341)
    (on b341 b1)
    (on b1 b147)
    (on-table b147)
    (clear b84)
    (on b84 b262)
    (on b262 b250)
    (on-table b250)
    (clear b179)
    (on-table b179)
    (clear b19)
    (on b19 b296)
    (on b296 b339)
    (on b339 b46)
    (on b46 b336)
    (on b336 b186)
    (on b186 b113)
    (on b113 b9)
    (on b9 b274)
    (on b274 b318)
    (on b318 b200)
    (on b200 b127)
    (on-table b127)
    (clear b222)
    (on-table b222)
    (clear b62)
    (on b62 b70)
    (on b70 b308)
    (on b308 b99)
    (on b99 b182)
    (on b182 b71)
    (on b71 b225)
    (on b225 b75)
    (on b75 b378)
    (on-table b378)
    (clear b45)
    (on b45 b345)
    (on b345 b310)
    (on b310 b181)
    (on-table b181)
    (clear b2)
    (on b2 b239)
    (on b239 b357)
    (on b357 b90)
    (on-table b90)
    (clear b183)
    (on b183 b344)
    (on-table b344)
    (clear b375)
    (on b375 b54)
    (on b54 b187)
    (on b187 b278)
    (on b278 b299)
    (on b299 b11)
    (on b11 b377)
    (on b377 b337)
    (on b337 b325)
    (on b325 b164)
    (on-table b164)
    (clear b18)
    (on-table b18)
    (clear b158)
    (on-table b158)
    (clear b247)
    (on b247 b208)
    (on b208 b366)
    (on-table b366)
    (clear b382)
    (on b382 b347)
    (on b347 b137)
    (on b137 b83)
    (on-table b83)
    (clear b23)
    (on b23 b253)
    (on b253 b372)
    (on b372 b50)
    (on-table b50)
    (clear b101)
    (on-table b101)
    (clear b306)
    (on b306 b264)
    (on b264 b175)
    (on b175 b22)
    (on b22 b302)
    (on b302 b269)
    (on-table b269)
    (clear b123)
    (on b123 b191)
    (on b191 b340)
    (on-table b340)
    (clear b268)
    (on b268 b252)
    (on-table b252)
    (clear b381)
    (on b381 b228)
    (on b228 b209)
    (on b209 b159)
    (on b159 b61)
    (on b61 b350)
    (on-table b350)
    (clear b32)
    (on-table b32)
    (clear b114)
    (on-table b114)
    (clear b107)
    (on b107 b329)
    (on-table b329)
    (clear b6)
    (on-table b6)
    (clear b364)
    (on-table b364)
    (clear b293)
    (on-table b293)
    (clear b355)
    (on b355 b365)
    (on-table b365)
    (clear b257)
    (on-table b257)
    (clear b4)
    (on b4 b55)
    (on b55 b229)
    (on b229 b48)
    (on b48 b160)
    (on b160 b261)
    (on b261 b323)
    (on b323 b94)
    (on b94 b288)
    (on b288 b298)
    (on-table b298)
    (clear b140)
    (on b140 b129)
    (on b129 b12)
    (on b12 b363)
    (on b363 b291)
    (on-table b291)
    (clear b294)
    (on b294 b227)
    (on b227 b376)
    (on b376 b282)
    (on b282 b67)
    (on b67 b324)
    (on b324 b332)
    (on b332 b68)
    (on b68 b231)
    (on b231 b167)
    (on b167 b131)
    (on b131 b315)
    (on b315 b148)
    (on b148 b189)
    (on b189 b379)
    (on-table b379)
    (clear b193)
    (on-table b193)
    (clear b368)
    (on b368 b20)
    (on b20 b30)
    (on b30 b10)
    (on b10 b279)
    (on b279 b118)
    (on b118 b126)
    (on-table b126)
    (clear b25)
    (on b25 b270)
    (on b270 b5)
    (on b5 b348)
    (on b348 b82)
    (on b82 b44)
    (on b44 b105)
    (on b105 b335)
    (on b335 b305)
    (on b305 b211)
    (on b211 b103)
    (on b103 b245)
    (on b245 b367)
    (on b367 b312)
    (on b312 b234)
    (on b234 b96)
    (on b96 b273)
    (on b273 b218)
    (on b218 b31)
    (on b31 b163)
    (on b163 b215)
    (on-table b215)
    (clear b108)
    (on b108 b122)
    (on-table b122)
    (clear b235)
    (on b235 b184)
    (on-table b184)
    (clear b168)
    (on-table b168)
    (clear b106)
    (on b106 b321)
    (on b321 b151)
    (on b151 b143)
    (on b143 b333)
    (on-table b333)
    (clear b354)
    (on-table b354)
    (clear b3)
    (on-table b3)
    (clear b188)
    (on-table b188)
    (clear b74)
    (on b74 b371)
    (on-table b371)
    (clear b284)
    (on b284 b72)
    (on b72 b244)
    (on-table b244)
    (clear b287)
    (on b287 b66)
    (on-table b66)
    (clear b330)
    (on b330 b233)
    (on b233 b27)
    (on b27 b238)
    (on-table b238)
    (clear b7)
    (on b7 b203)
    (on b203 b267)
    (on b267 b192)
    (on-table b192)
    (clear b328)
    (on b328 b172)
    (on-table b172)
    (clear b41)
    (on-table b41)
    (clear b78)
    (on b78 b283)
    (on b283 b133)
    (on b133 b110)
    (on-table b110)
    (clear b221)
    (on b221 b111)
    (on-table b111)
    (clear b98)
    (on b98 b297)
    (on-table b297)
    (clear b362)
    (on-table b362)
    (clear b125)
    (on-table b125)
    (clear b266)
    (on b266 b369)
    (on b369 b171)
    (on b171 b213)
    (on b213 b300)
    (on-table b300)
    (clear b40)
    (on b40 b263)
    (on b263 b65)
    (on b65 b214)
    (on b214 b242)
    (on b242 b102)
    (on b102 b313)
    (on b313 b194)
    (on-table b194)
    (clear b109)
    (on b109 b33)
    (on-table b33)
    (clear b77)
    (on-table b77)
    (clear b277)
    (on b277 b260)
    (on-table b260)
    (clear b275)
    (on b275 b220)
    (on b220 b383)
    (on b383 b198)
    (on b198 b29)
    (on b29 b207)
    (on-table b207)
    (clear b152)
    (on b152 b190)
    (on b190 b356)
    (on b356 b205)
    (on-table b205)
    (clear b217)
    (on b217 b161)
    (on b161 b281)
    (on b281 b240)
    (on b240 b352)
    (on b352 b170)
    (on-table b170)
    (clear b216)
    (on-table b216)
    (clear b319)
    (on b319 b343)
    (on b343 b292)
    (on-table b292)
    (clear b87)
    (on b87 b226)
    (on b226 b26)
    (on b26 b35)
    (on b35 b153)
    (on b153 b173)
    (on b173 b311)
    (on-table b311)
    (clear b206)
    (on b206 b86)
    (on b86 b224)
    (on b224 b334)
    (on b334 b73)
    (on b73 b256)
    (on-table b256)
    (clear b154)
    (on b154 b289)
    (on-table b289)
    (clear b210)
    (on b210 b285)
    (on b285 b196)
    (on-table b196)
    (clear b132)
    (on b132 b138)
    (on b138 b307)
    (on b307 b199)
    (on b199 b91)
    (on b91 b36)
    (on-table b36)
    (clear b304)
    (on b304 b100)
    (on-table b100)
    (clear b326)
    (on b326 b128)
    (on-table b128)
    (clear b92)
    (on b92 b150)
    (on-table b150)
    (clear b115)
    (on b115 b51)
    (on-table b51)
    (clear b43)
    (on-table b43)
    (clear b265)
    (on b265 b38)
    (on b38 b136)
    (on b136 b301)
    (on b301 b134)
    (on-table b134)
    (clear b322)
    (on b322 b97)
    (on b97 b230)
    (on-table b230)
    (clear b317)
    (on b317 b370)
    (on b370 b251)
    (on-table b251)
    (clear b57)
    (on b57 b361)
    (on b361 b156)
    (on b156 b202)
    (on b202 b79)
    (on b79 b178)
    (on b178 b39)
    (on b39 b243)
    (on-table b243)
    (clear b219)
    (on b219 b81)
    (on b81 b286)
    (on-table b286)
    (clear b80)
    (on b80 b121)
    (on b121 b112)
    (on b112 b95)
    (on b95 b169)
    (on-table b169)
    (clear b85)
    (on b85 b56)
    (on b56 b359)
    (on b359 b316)
    (on b316 b119)
    (on-table b119)
    (clear b145)
    (on b145 b63)
    (on b63 b271)
    (on-table b271)
    (clear b42)
    (on-table b42)
    (clear b69)
    (on b69 b116)
    (on b116 b13)
    (on-table b13)
    (clear b124)
    (on-table b124)
    (clear b34)
    (on b34 b223)
    (on b223 b259)
    (on b259 b360)
    (on b360 b59)
    (on b59 b358)
    (on b358 b176)
    (on b176 b276)
    (on b276 b135)
    (on b135 b130)
    (on b130 b201)
    (on-table b201)
    (clear b295)
    (on b295 b177)
    (on b177 b58)
    (on b58 b139)
    (on b139 b353)
    (on b353 b373)
    (on b373 b165)
    (on b165 b212)
    (on-table b212)
    (clear b290)
    (on b290 b76)
    (on b76 b93)
    (on b93 b47)
    (on b47 b197)
    (on b197 b16)
    (on-table b16)
    (clear b155)
    (on b155 b120)
    (on-table b120)
    (clear b89)
    (on-table b89)
    (clear b342)
    (on b342 b185)
    (on-table b185)
    (clear b338)
    (on-table b338)
    (clear b60)
    (on b60 b24)
    (on b24 b351)
    (on-table b351)
    (clear b232)
    (on b232 b236)
    (on b236 b327)
    (on b327 b303)
    (on b303 b37)
    (on-table b37)
    (clear b309)
    (on b309 b52)
    (on b52 b374)
    (on-table b374)
    (clear b320)
    (on-table b320)
    (clear b248)
    (on-table b248)
    (clear b272)
    (on-table b272)
    (clear b157)
    (on b157 b142)
    (on-table b142)
    (clear b180)
    (on b180 b258)
    (on b258 b17)
    (on b17 b117)
    (on-table b117)
    (clear b174)
    (on-table b174)
    (clear b254)
    (on b254 b249)
    (on-table b249)
    (clear b53)
    (on b53 b28)
    (on-table b28)
    (clear b314)
    (on b314 b141)
    (on b141 b146)
    (on-table b146)
    (clear b255)
    (on-table b255)
    (clear b49)
    (on-table b49))
 (:goal  (and 
    (clear b9)
    (on b9 b10)
    (on b10 b2)
    (on b2 b1)
    (on b1 b8)
    (on b8 b4)
    (on-table b4)
    (clear b6)
    (on b6 b7)
    (on b7 b5)
    (on b5 b3)
    (on b3 b11)
    (on-table b11))))

; plan
1. (unstack b4 b55)
   deleted: (on b4 b55) (clear b4) (arm-empty)
   added: (holding b4) (clear b55)
   goals met: 1 of 13
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 13
3. (unstack b19 b296)
   deleted: (on b19 b296) (clear b19) (arm-empty)
   added: (holding b19) (clear b296)
   goals met: 2 of 13
4. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 13
5. (unstack b204 b64)
   deleted: (on b204 b64) (clear b204) (arm-empty)
   added: (holding b204) (clear b64)
   goals met: 2 of 13
6. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 2 of 13
7. (unstack b25 b270)
   deleted: (on b25 b270) (clear b25) (arm-empty)
   added: (holding b25) (clear b270)
   goals met: 2 of 13
8. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 13
9. (unstack b270 b5)
   deleted: (on b270 b5) (clear b270) (arm-empty)
   added: (holding b270) (clear b5)
   goals met: 2 of 13
10. (putdown b270)
   deleted: (holding b270)
   added: (clear b270) (arm-empty) (on-table b270)
   goals met: 2 of 13
11. (unstack b296 b339)
   deleted: (on b296 b339) (clear b296) (arm-empty)
   added: (holding b296) (clear b339)
   goals met: 2 of 13
12. (putdown b296)
   deleted: (holding b296)
   added: (clear b296) (arm-empty) (on-table b296)
   goals met: 2 of 13
13. (unstack b339 b46)
   deleted: (on b339 b46) (clear b339) (arm-empty)
   added: (holding b339) (clear b46)
   goals met: 2 of 13
14. (putdown b339)
   deleted: (holding b339)
   added: (clear b339) (arm-empty) (on-table b339)
   goals met: 2 of 13
15. (unstack b368 b20)
   deleted: (on b368 b20) (clear b368) (arm-empty)
   added: (holding b368) (clear b20)
   goals met: 2 of 13
16. (putdown b368)
   deleted: (holding b368)
   added: (clear b368) (arm-empty) (on-table b368)
   goals met: 2 of 13
17. (unstack b20 b30)
   deleted: (on b20 b30) (clear b20) (arm-empty)
   added: (holding b20) (clear b30)
   goals met: 2 of 13
18. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 13
19. (unstack b30 b10)
   deleted: (on b30 b10) (clear b30) (arm-empty)
   added: (holding b30) (clear b10)
   goals met: 2 of 13
20. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 13
21. (unstack b375 b54)
   deleted: (on b375 b54) (clear b375) (arm-empty)
   added: (holding b375) (clear b54)
   goals met: 2 of 13
22. (putdown b375)
   deleted: (holding b375)
   added: (clear b375) (arm-empty) (on-table b375)
   goals met: 2 of 13
23. (unstack b46 b336)
   deleted: (on b46 b336) (clear b46) (arm-empty)
   added: (holding b46) (clear b336)
   goals met: 2 of 13
24. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 2 of 13
25. (unstack b336 b186)
   deleted: (on b336 b186) (clear b336) (arm-empty)
   added: (holding b336) (clear b186)
   goals met: 2 of 13
26. (putdown b336)
   deleted: (holding b336)
   added: (clear b336) (arm-empty) (on-table b336)
   goals met: 2 of 13
27. (unstack b186 b113)
   deleted: (on b186 b113) (clear b186) (arm-empty)
   added: (holding b186) (clear b113)
   goals met: 2 of 13
28. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 2 of 13
29. (unstack b113 b9)
   deleted: (on b113 b9) (clear b113) (arm-empty)
   added: (holding b113) (clear b9)
   goals met: 3 of 13
30. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 3 of 13
31. (unstack b54 b187)
   deleted: (on b54 b187) (clear b54) (arm-empty)
   added: (holding b54) (clear b187)
   goals met: 3 of 13
32. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 3 of 13
33. (unstack b187 b278)
   deleted: (on b187 b278) (clear b187) (arm-empty)
   added: (holding b187) (clear b278)
   goals met: 3 of 13
34. (putdown b187)
   deleted: (holding b187)
   added: (clear b187) (arm-empty) (on-table b187)
   goals met: 3 of 13
35. (unstack b278 b299)
   deleted: (on b278 b299) (clear b278) (arm-empty)
   added: (holding b278) (clear b299)
   goals met: 3 of 13
36. (putdown b278)
   deleted: (holding b278)
   added: (clear b278) (arm-empty) (on-table b278)
   goals met: 3 of 13
37. (unstack b299 b11)
   deleted: (on b299 b11) (clear b299) (arm-empty)
   added: (holding b299) (clear b11)
   goals met: 3 of 13
38. (putdown b299)
   deleted: (holding b299)
   added: (clear b299) (arm-empty) (on-table b299)
   goals met: 3 of 13
39. (unstack b11 b377)
   deleted: (on b11 b377) (clear b11) (arm-empty)
   added: (holding b11) (clear b377)
   goals met: 3 of 13
40. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 13
41. (unstack b64 b341)
   deleted: (on b64 b341) (clear b64) (arm-empty)
   added: (holding b64) (clear b341)
   goals met: 4 of 13
42. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 13
43. (unstack b341 b1)
   deleted: (on b341 b1) (clear b341) (arm-empty)
   added: (holding b341) (clear b1)
   goals met: 4 of 13
44. (putdown b341)
   deleted: (holding b341)
   added: (clear b341) (arm-empty) (on-table b341)
   goals met: 4 of 13
45. (unstack b88 b8)
   deleted: (on b88 b8) (clear b88) (arm-empty)
   added: (holding b88) (clear b8)
   goals met: 4 of 13
46. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 4 of 13
47. (unstack b1 b147)
   deleted: (on b1 b147) (clear b1) (arm-empty)
   added: (holding b1) (clear b147)
   goals met: 4 of 13
48. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 5 of 13
49. (unstack b10 b279)
   deleted: (on b10 b279) (clear b10) (arm-empty)
   added: (holding b10) (clear b279)
   goals met: 5 of 13
50. (stack b10 b2)
   deleted: (clear b2) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b2)
   goals met: 6 of 13
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 13
52. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 7 of 13
53. (unstack b5 b348)
   deleted: (on b5 b348) (clear b5) (arm-empty)
   added: (holding b5) (clear b348)
   goals met: 7 of 13
54. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 8 of 13
55. (unstack b7 b203)
   deleted: (on b7 b203) (clear b7) (arm-empty)
   added: (holding b7) (clear b203)
   goals met: 8 of 13
56. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 9 of 13
57. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 13
58. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 10 of 13
59. (unstack b9 b274)
   deleted: (on b9 b274) (clear b9) (arm-empty)
   added: (holding b9) (clear b274)
   goals met: 9 of 13
60. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 11 of 13
61. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 10 of 13
62. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 10 of 13
63. (unstack b8 b384)
   deleted: (on b8 b384) (clear b8) (arm-empty)
   added: (holding b8) (clear b384)
   goals met: 10 of 13
64. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 11 of 13
65. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 11 of 13
66. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 12 of 13
67. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 10 of 13
68. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 11 of 13
69. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 10 of 13
70. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 10 of 13
71. (unstack b2 b239)
   deleted: (on b2 b239) (clear b2) (arm-empty)
   added: (holding b2) (clear b239)
   goals met: 10 of 13
72. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 11 of 13
73. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 11 of 13
74. (stack b10 b2)
   deleted: (clear b2) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b2)
   goals met: 12 of 13
75. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 11 of 13
76. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 13 of 13
